app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    # store the article record in an instance variable
    @article = Article.find(params[:id])

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2021-01-04 20:48:31.891692"], ["id", 1]]
---
  def update
    # Query the database for the Article record that matches the :id passed to the route.
    # Store the query in an instance variable.
    @article = Article.find(params[:id])
    # Update the values passed from the form (the update method here is the update method supplied by Active Record, not the update method we're creating).
    # Save the changes in the database.
    @article.update(title: params[:article][:title], description: params[:article][:description])